; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-8-6-39)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	driver8 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	package35 - package
	package36 - package
	package37 - package
	package38 - package
	package39 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-1 - location
	p0-2 - location
	p0-3 - location
	p1-2 - location
	p2-5 - location
	p3-2 - location
	p3-4 - location
	p4-1 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s4)
	(at driver3 s5)
	(at driver4 s2)
	(at driver5 s1)
	(at driver6 s1)
	(at driver7 s5)
	(at driver8 s3)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s0)
	(empty truck5)
	(at truck6 s5)
	(empty truck6)
	(at package1 s1)
	(at package2 s4)
	(at package3 s4)
	(at package4 s5)
	(at package5 s2)
	(at package6 s2)
	(at package7 s4)
	(at package8 s1)
	(at package9 s2)
	(at package10 s5)
	(at package11 s1)
	(at package12 s1)
	(at package13 s0)
	(at package14 s1)
	(at package15 s4)
	(at package16 s1)
	(at package17 s3)
	(at package18 s4)
	(at package19 s2)
	(at package20 s3)
	(at package21 s3)
	(at package22 s4)
	(at package23 s1)
	(at package24 s0)
	(at package25 s4)
	(at package26 s3)
	(at package27 s0)
	(at package28 s0)
	(at package29 s5)
	(at package30 s5)
	(at package31 s5)
	(at package32 s0)
	(at package33 s1)
	(at package34 s5)
	(at package35 s2)
	(at package36 s4)
	(at package37 s4)
	(at package38 s3)
	(at package39 s5)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(link s1 s0)
	(link s0 s1)
	(link s1 s2)
	(link s2 s1)
	(link s1 s3)
	(link s3 s1)
	(link s1 s4)
	(link s4 s1)
	(link s3 s2)
	(link s2 s3)
	(link s3 s5)
	(link s5 s3)
	(link s4 s0)
	(link s0 s4)
	(link s4 s2)
	(link s2 s4)
	(link s4 s3)
	(link s3 s4)
	(link s4 s5)
	(link s5 s4)
	(link s5 s0)
	(link s0 s5)
	(link s5 s1)
	(link s1 s5)
)
	(:goal (and
	(at driver2 s3)
	(at driver3 s2)
	(at driver5 s4)
	(at driver6 s4)
	(at driver8 s2)
	(at truck3 s4)
	(at truck5 s2)
	(at truck6 s5)
	(at package2 s2)
	(at package3 s1)
	(at package4 s4)
	(at package5 s1)
	(at package6 s3)
	(at package7 s3)
	(at package8 s5)
	(at package9 s0)
	(at package10 s5)
	(at package11 s1)
	(at package12 s5)
	(at package13 s4)
	(at package14 s3)
	(at package15 s5)
	(at package16 s2)
	(at package18 s2)
	(at package19 s4)
	(at package20 s3)
	(at package21 s5)
	(at package22 s1)
	(at package23 s1)
	(at package24 s3)
	(at package25 s2)
	(at package26 s3)
	(at package27 s1)
	(at package28 s0)
	(at package29 s3)
	(at package30 s0)
	(at package31 s4)
	(at package32 s2)
	(at package33 s3)
	(at package34 s4)
	(at package35 s3)
	(at package36 s0)
	(at package37 s1)
	(at package38 s1)
	(at package39 s1)
	))


)

; plan
1. (board-truck driver4 s2 truck1)
   deleted: (at driver4 s2) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 7 of 45
2. (drive-truck driver4 s2 s4 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   goals met: 7 of 45
3. (load-truck s4 package7 truck1)
   deleted: (at package7 s4)
   added: (in package7 truck1)
   goals met: 7 of 45
4. (load-truck s4 package37 truck1)
   deleted: (at package37 s4)
   added: (in package37 truck1)
   goals met: 7 of 45
5. (load-truck s4 package36 truck1)
   deleted: (at package36 s4)
   added: (in package36 truck1)
   goals met: 7 of 45
6. (load-truck s4 package3 truck1)
   deleted: (at package3 s4)
   added: (in package3 truck1)
   goals met: 7 of 45
7. (drive-truck driver4 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 7 of 45
8. (load-truck s1 package8 truck1)
   deleted: (at package8 s1)
   added: (in package8 truck1)
   goals met: 7 of 45
9. (unload-truck s1 package37 truck1)
   deleted: (in package37 truck1)
   added: (at package37 s1)
   goals met: 8 of 45
10. (load-truck s1 package33 truck1)
   deleted: (at package33 s1)
   added: (in package33 truck1)
   goals met: 8 of 45
11. (drive-truck driver4 s1 s4 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 8 of 45
12. (load-truck s4 package25 truck1)
   deleted: (at package25 s4)
   added: (in package25 truck1)
   goals met: 8 of 45
13. (load-truck s4 package22 truck1)
   deleted: (at package22 s4)
   added: (in package22 truck1)
   goals met: 8 of 45
14. (drive-truck driver4 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 8 of 45
15. (unload-truck s1 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   goals met: 9 of 45
16. (unload-truck s1 package22 truck1)
   deleted: (in package22 truck1)
   added: (at package22 s1)
   goals met: 10 of 45
17. (load-truck s1 package16 truck1)
   deleted: (at package16 s1)
   added: (in package16 truck1)
   goals met: 10 of 45
18. (drive-truck driver4 s1 s4 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 10 of 45
19. (load-truck s4 package2 truck1)
   deleted: (at package2 s4)
   added: (in package2 truck1)
   goals met: 10 of 45
20. (load-truck s4 package18 truck1)
   deleted: (at package18 s4)
   added: (in package18 truck1)
   goals met: 10 of 45
21. (drive-truck driver4 s4 s2 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 10 of 45
22. (load-truck s2 package9 truck1)
   deleted: (at package9 s2)
   added: (in package9 truck1)
   goals met: 10 of 45
23. (load-truck s2 package6 truck1)
   deleted: (at package6 s2)
   added: (in package6 truck1)
   goals met: 10 of 45
24. (drive-truck driver4 s2 s4 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   goals met: 10 of 45
25. (load-truck s4 package15 truck1)
   deleted: (at package15 s4)
   added: (in package15 truck1)
   goals met: 10 of 45
26. (drive-truck driver4 s4 s5 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   goals met: 10 of 45
27. (unload-truck s5 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s5)
   goals met: 11 of 45
28. (load-truck s5 package4 truck1)
   deleted: (at package4 s5)
   added: (in package4 truck1)
   goals met: 11 of 45
29. (drive-truck driver4 s5 s4 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   goals met: 11 of 45
30. (unload-truck s4 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s4)
   goals met: 12 of 45
31. (load-truck s1 package14 truck2)
   deleted: (at package14 s1)
   added: (in package14 truck2)
   goals met: 12 of 45
32. (board-truck driver5 s1 truck2)
   deleted: (at driver5 s1) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 12 of 45
33. (drive-truck driver4 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 12 of 45
34. (drive-truck driver4 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 12 of 45
35. (drive-truck driver4 s5 s3 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   goals met: 12 of 45
36. (drive-truck driver4 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 12 of 45
37. (load-truck s2 package5 truck1)
   deleted: (at package5 s2)
   added: (in package5 truck1)
   goals met: 12 of 45
38. (load-truck s2 package35 truck1)
   deleted: (at package35 s2)
   added: (in package35 truck1)
   goals met: 12 of 45
39. (drive-truck driver4 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 12 of 45
40. (unload-truck s3 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s3)
   goals met: 13 of 45
41. (unload-truck s3 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s3)
   goals met: 14 of 45
42. (load-truck s3 package38 truck1)
   deleted: (at package38 s3)
   added: (in package38 truck1)
   goals met: 14 of 45
43. (drive-truck driver4 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 14 of 45
44. (unload-truck s1 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s1)
   goals met: 15 of 45
45. (drive-truck driver4 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 15 of 45
46. (unload-truck s0 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s0)
   goals met: 16 of 45
47. (drive-truck driver4 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 16 of 45
48. (load-truck s5 package39 truck1)
   deleted: (at package39 s5)
   added: (in package39 truck1)
   goals met: 16 of 45
49. (drive-truck driver4 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 16 of 45
50. (drive-truck driver4 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 16 of 45
51. (unload-truck s2 package25 truck1)
   deleted: (in package25 truck1)
   added: (at package25 s2)
   goals met: 17 of 45
52. (unload-truck s2 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s2)
   goals met: 18 of 45
53. (drive-truck driver4 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 18 of 45
54. (drive-truck driver4 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 18 of 45
55. (unload-truck s0 package36 truck1)
   deleted: (in package36 truck1)
   added: (at package36 s0)
   goals met: 19 of 45
56. (drive-truck driver4 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 19 of 45
57. (load-truck s5 package34 truck1)
   deleted: (at package34 s5)
   added: (in package34 truck1)
   goals met: 19 of 45
58. (drive-truck driver4 s5 s3 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   goals met: 19 of 45
59. (unload-truck s3 package35 truck1)
   deleted: (in package35 truck1)
   added: (at package35 s3)
   goals met: 20 of 45
60. (unload-truck s3 package33 truck1)
   deleted: (in package33 truck1)
   added: (at package33 s3)
   goals met: 21 of 45
61. (drive-truck driver4 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 21 of 45
62. (drive-truck driver4 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 21 of 45
63. (load-truck s0 package32 truck1)
   deleted: (at package32 s0)
   added: (in package32 truck1)
   goals met: 21 of 45
64. (load-truck s0 package27 truck1)
   deleted: (at package27 s0)
   added: (in package27 truck1)
   goals met: 21 of 45
65. (drive-truck driver4 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 21 of 45
66. (unload-truck s1 package39 truck1)
   deleted: (in package39 truck1)
   added: (at package39 s1)
   goals met: 22 of 45
67. (drive-truck driver4 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 22 of 45
68. (unload-truck s2 package32 truck1)
   deleted: (in package32 truck1)
   added: (at package32 s2)
   goals met: 23 of 45
69. (load-truck s2 package19 truck1)
   deleted: (at package19 s2)
   added: (in package19 truck1)
   goals met: 23 of 45
70. (drive-truck driver4 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 23 of 45
71. (unload-truck s1 package38 truck1)
   deleted: (in package38 truck1)
   added: (at package38 s1)
   goals met: 24 of 45
72. (drive-truck driver4 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 24 of 45
73. (load-truck s0 package24 truck1)
   deleted: (at package24 s0)
   added: (in package24 truck1)
   goals met: 24 of 45
74. (drive-truck driver4 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 24 of 45
75. (drive-truck driver4 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 24 of 45
76. (unload-truck s3 package24 truck1)
   deleted: (in package24 truck1)
   added: (at package24 s3)
   goals met: 25 of 45
77. (drive-truck driver4 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 25 of 45
78. (unload-truck s4 package34 truck1)
   deleted: (in package34 truck1)
   added: (at package34 s4)
   goals met: 26 of 45
79. (drive-truck driver4 s4 s5 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   goals met: 26 of 45
80. (load-truck s5 package31 truck1)
   deleted: (at package31 s5)
   added: (in package31 truck1)
   goals met: 26 of 45
81. (drive-truck driver4 s5 s4 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   goals met: 26 of 45
82. (unload-truck s4 package31 truck1)
   deleted: (in package31 truck1)
   added: (at package31 s4)
   goals met: 27 of 45
83. (unload-truck s4 package19 truck1)
   deleted: (in package19 truck1)
   added: (at package19 s4)
   goals met: 28 of 45
84. (drive-truck driver4 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 28 of 45
85. (load-truck s0 package13 truck1)
   deleted: (at package13 s0)
   added: (in package13 truck1)
   goals met: 28 of 45
86. (drive-truck driver4 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 28 of 45
87. (unload-truck s1 package27 truck1)
   deleted: (in package27 truck1)
   added: (at package27 s1)
   goals met: 29 of 45
88. (drive-truck driver4 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 29 of 45
89. (unload-truck s2 package18 truck1)
   deleted: (in package18 truck1)
   added: (at package18 s2)
   goals met: 30 of 45
90. (drive-truck driver4 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 30 of 45
91. (drive-truck driver4 s3 s5 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 30 of 45
92. (load-truck s5 package30 truck1)
   deleted: (at package30 s5)
   added: (in package30 truck1)
   goals met: 30 of 45
93. (drive-truck driver4 s5 s0 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   goals met: 30 of 45
94. (unload-truck s0 package30 truck1)
   deleted: (in package30 truck1)
   added: (at package30 s0)
   goals met: 31 of 45
95. (drive-truck driver5 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 31 of 45
96. (load-truck s3 package21 truck2)
   deleted: (at package21 s3)
   added: (in package21 truck2)
   goals met: 31 of 45
97. (drive-truck driver5 s3 s5 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   goals met: 31 of 45
98. (load-truck s5 package29 truck2)
   deleted: (at package29 s5)
   added: (in package29 truck2)
   goals met: 31 of 45
99. (drive-truck driver5 s5 s3 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   goals met: 31 of 45
100. (unload-truck s3 package29 truck2)
   deleted: (in package29 truck2)
   added: (at package29 s3)
   goals met: 32 of 45
101. (unload-truck s3 package14 truck2)
   deleted: (in package14 truck2)
   added: (at package14 s3)
   goals met: 33 of 45
102. (drive-truck driver5 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 33 of 45
103. (walk driver2 s4 p3-4)
   deleted: (at driver2 s4)
   added: (at driver2 p3-4)
   goals met: 33 of 45
104. (walk driver2 p3-4 s3)
   deleted: (at driver2 p3-4)
   added: (at driver2 s3)
   goals met: 34 of 45
105. (walk driver3 s5 p2-5)
   deleted: (at driver3 s5)
   added: (at driver3 p2-5)
   goals met: 34 of 45
106. (walk driver3 p2-5 s2)
   deleted: (at driver3 p2-5)
   added: (at driver3 s2)
   goals met: 35 of 45
107. (walk driver6 s1 p4-1)
   deleted: (at driver6 s1)
   added: (at driver6 p4-1)
   goals met: 35 of 45
108. (walk driver6 p4-1 s4)
   deleted: (at driver6 p4-1)
   added: (at driver6 s4)
   goals met: 36 of 45
109. (walk driver8 s3 p3-2)
   deleted: (at driver8 s3)
   added: (at driver8 p3-2)
   goals met: 36 of 45
110. (walk driver8 p3-2 s2)
   deleted: (at driver8 p3-2)
   added: (at driver8 s2)
   goals met: 37 of 45
111. (drive-truck driver4 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 37 of 45
112. (load-truck s1 package12 truck1)
   deleted: (at package12 s1)
   added: (in package12 truck1)
   goals met: 37 of 45
113. (drive-truck driver4 s1 s4 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 37 of 45
114. (unload-truck s4 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s4)
   goals met: 38 of 45
115. (drive-truck driver4 s4 s5 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   goals met: 38 of 45
116. (unload-truck s5 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s5)
   goals met: 39 of 45
117. (unload-truck s5 package12 truck1)
   deleted: (in package12 truck1)
   added: (at package12 s5)
   goals met: 40 of 45
118. (drive-truck driver4 s5 s4 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   goals met: 40 of 45
119. (drive-truck driver4 s4 s2 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 40 of 45
120. (unload-truck s2 package16 truck1)
   deleted: (in package16 truck1)
   added: (at package16 s2)
   goals met: 41 of 45
121. (walk driver8 s2 p0-2)
   deleted: (at driver8 s2)
   added: (at driver8 p0-2)
   goals met: 40 of 45
122. (walk driver8 p0-2 s0)
   deleted: (at driver8 p0-2)
   added: (at driver8 s0)
   goals met: 40 of 45
123. (drive-truck driver5 s4 s5 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   goals met: 40 of 45
124. (unload-truck s5 package21 truck2)
   deleted: (in package21 truck2)
   added: (at package21 s5)
   goals met: 41 of 45
125. (drive-truck driver5 s5 s4 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   goals met: 41 of 45
126. (board-truck driver8 s0 truck5)
   deleted: (at driver8 s0) (empty truck5)
   added: (driving driver8 truck5)
   goals met: 41 of 45
127. (drive-truck driver8 s0 s4 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   goals met: 41 of 45
128. (drive-truck driver8 s4 s2 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s2)
   goals met: 42 of 45
129. (drive-truck driver5 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 42 of 45
130. (disembark-truck driver8 s2 truck5)
   deleted: (driving driver8 truck5)
   added: (at driver8 s2) (empty truck5)
   goals met: 43 of 45
131. (disembark-truck driver5 s0 truck2)
   deleted: (driving driver5 truck2)
   added: (at driver5 s0) (empty truck2)
   goals met: 43 of 45
132. (board-truck driver5 s0 truck3)
   deleted: (at driver5 s0) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 43 of 45
133. (drive-truck driver5 s0 s4 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   goals met: 44 of 45
134. (disembark-truck driver5 s4 truck3)
   deleted: (driving driver5 truck3)
   added: (at driver5 s4) (empty truck3)
   goals met: 45 of 45
